# DLDSetLoadDataReal

## Description
Using selector, sets default load data with real value for the parametric object.
Available selectors : kDLDSelectorWeight = 5.

```pascal
PROCEDURE DLDSetLoadDataReal(
				selector : INTEGER;
				value    : REAL);
```

```python
def vs.DLDSetLoadDataReal(selector, value):
    return None
```

## Parameters
|Name|Type|Description|
|---|---|---|
|selector|INTEGER|   |
|value|REAL|   |

## Version
Availability: from Vectorworks 2018

## Category
* Truss Analysis